init.org
#+TITLE: My Emacs's Configuration
#+AUTHOR: Kebairia Zakaria
#+STARTUP: overview
#+PROPERTY: header-args :results none
#+ARCHIVE: ~/org/config_archive.org::
* BOOTSTRAP
  :PROPERTIES:
  :header-args: :tangle ~/.config/emacs/init.el
  :header-args: :results none
  :END:
   #+begin_src emacs-lisp
     ;;; package --- SummarY
     ;; Load configuration from ~/.config/emacs/settings.org

     ;;; Commentary:
     ;; Added by Package.el.  This must come before configurations of
     ;; installed packages.  Don't delete this line.  If you don't want it,
     ;; just comment it out by adding a semicolon to the start of the line.
     ;; You may delete these explanatory comments.
     (require 'package)
     (add-to-list 'package-archives '("gnu" . "https://elpa.gnu.org/packages/") t)
     (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
     (add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/") t)

     (package-initialize)

     (defconst user-init-dir
       (cond ((boundp 'user-emacs-directory)
              user-emacs-directory)
             ((boundp 'user-init-directory)
              user-init-directory)
             (t "~/.config/emacs")))

     (defun load-user-file (file)
       (interactive "f")
       "Load a file in current user's configuration directory"
       (load-file (expand-file-name file user-init-dir)))

     (load-user-file "DEFAULTS.el")
     (load-user-file "KEYBIDING.el")
     (load-user-file "PACKAGES.el")
     (load-user-file "ORG.el")
     (load-user-file "elegant-theme/elegance.el")
   #+end_src

* BETTER DEFAULTS
  :PROPERTIES:
  :header-args: :tangle ~/.config/emacs/DEFAULTS.el
  :header-args: :results none
  :END:
*** Garbage Collection
    - The garbage collection in Emacs is very simple.
      You allocate some bytes and once you pass a certain threshold, it garbage collects. That’s it.
      - More infos [[https://bling.github.io/blog/2016/01/18/why-are-you-changing-gc-cons-threshold/][here]] and [[https://www.reddit.com/r/emacs/comments/3kqt6e/2_easy_little_known_steps_to_speed_up_emacs_start/][here]]
    #+begin_src emacs-lisp
     ;; reduce the frequency of garbage collection by making it happen on
     ;; each 50MB of allocated data (the default is on every 0.76MB)
     (setq gc-cons-threshold 50000000)
    #+end_src
*** COMMENT Better Defaults
   #+BEGIN_SRC emacs-lisp
     ;; Better Defaults
     ;;----------------
     ;;(add-to-list
     ;; 'default-frame-alist '(fullscreen . fullboth)) ; Start emacs/emacsclient in fullscreen mode
     (require 'generic-x)                        ; Add syntax high' for ini/conf/batch files
     (setq-default
         inhibit-startup-screen t                ; Disable start-up screen
         initial-scratch-message ""              ; Empty the initial *scratch* buffer
         fill-column 80                          ; Set width for automatic line breaks
         tab-width 4                             ; Set width for tabs
         indent-tabs-mode nil                    ; Stop using tabs to indent
         font-lock-maximum-decoration t          ; Supports multiple levels of complexity for highlighting
         ;split-width-threshold nil              ; Disable horizontal window splitting
         sentence-end-double-space nil           ; End a sentence after a dot and a space
         show-trailing-whitespace nil            ; Display trailing whitespaces
         select-enable-clipboard t               ; Merge system's and Emacs' clipboard
         uniquify-buffer-name-style 'forward     ; Uniquify buffer names
         help-window-select t)                   ; Focus new help windows when opened
     (setq
         byte-compile-warnings '(cl-functions)   ; disable cl warning
         dired-listing-switches "-ahBGFv1l  --group-directories-first" ;; set dired-listing-switches
         require-final-newline t                 ; Most UNIX tools work best when there’s a
                                                 ;   newline on all files.
         tramp-default-method "ssh"              ; set the default tramp method --> ssh
         tab-always-indent 'complete             ; Tab always indent
         initial-major-mode 'org-mode            ; Major mode for scratch buffer
         large-file-warning-threshold 100000000) ; Warn when opening files bigger than 100MB
     (menu-bar-mode -1)                          ; Disable menu-bar
     (blink-cursor-mode 0)                       ; Disable the cursor blinking
     (scroll-bar-mode 0)                         ; Disable the scroll bar "|"
     (tool-bar-mode 0)                           ; Disable the tool bar (icons)
     (tooltip-mode 0)                            ; Disable the tooltips
     (column-number-mode 1)                      ; Show the column number
     (show-paren-mode 1)                         ; Show paren mode
     (electric-pair-mode 1)
     (global-hl-line-mode t)                     ; highlight current line
     (fset 'yes-or-no-p 'y-or-n-p)               ; Replace yes/no prompts with y/n
     (global-visual-line-mode t)                 ; Enable word-wrapping (fit in the available width of a page)
     (put 'narrow-to-region 'disabled nil)       ; enable narrow to region
     (global-set-key
         (kbd "TAB") 'tab-to-tab-stop)
     (add-hook                                   ; Automatically deletes trailing whitespace
            'write-file-hooks                    ;  after every line when saving a file
            'delete-trailing-whitespace)

     (add-hook 'prog-mode-hook #'rainbow-mode)   ; show color faces
     (add-hook 'org-mode-hook #'rainbow-mode)    ; for modes(prog,org,txt)
     (add-hook 'text-mode-hook #'rainbow-mode)   ;exp #2398f9

   #+END_SRC
*** COMMENT Fonts,Line numbers
    #+BEGIN_SRC emacs-lisp
      ;; Fonts, line nubmers ..etc
      ;;--------------------------
       (set-frame-font "FantasqueSansMono 13" nil t)
       ;; fix the emacsclient font problem
       (add-to-list 'default-frame-alist '(font . "FantasqueSansMono 13")) ;; Font type & size

       (setq-default
           display-line-numbers-current-absolute t ;  Enable the line nubmers
           display-line-numbers-width 2
           display-line-numbers-widen t)
       (add-hook 'text-mode-hook #'display-line-numbers-mode)
       (add-hook 'prog-mode-hook #'display-line-numbers-mode)
       (add-hook 'fundamental-mode-hook #'display-line-numbers-mode)
       (custom-set-faces
         ;; Make Comments/strings italic
         '(font-lock-comment-face ((t (:forground "#928374" :slant italic t))))
         '(font-lock-string-face ((t (:foreground "#b8bb26" :slant italic))))
         '(italic ((t (:underline nil :slant italic))))
         '(dired-directory ((t (:inherit nil :foreground "#00b0d1" :weight bold))))
         '(line-number ((t (:background "#1d2021" :foreground "#7c6f64"))))
         '(line-number-current-line ((t (:background "#504945" :foreground "#fe8019")))))

    #+END_SRC
*** Hist, Backup and auto-save
     check it here: [[https://github.com/bradwright/emacs.d]]
    #+BEGIN_SRC emacs-lisp
      ;; Hist, Backup and auto-save ..etc
      ;;---------------------------------
      (setq backup-directory-alist '(("." . "~/.config/emacs/backup"))
        backup-by-copying t                       ; Don't delink hardlinks
        version-control t                         ; Use version numbers on backups
        delete-old-versions t                     ; Automatically delete excess backups
        kept-new-versions 3                       ; how many of the newest versions to keep
        kept-old-versions 3                       ; and how many of the old
        vc-make-backup-files t                    ; Even version controlled files get to be backed up.
        )
      (setq auto-save-file-name-transforms
            '((".*" "~/.config/emacs/undo/" t)))
      (setq undo-tree-history-directory-alist     ; Saving persistent tree-undo to a single directory
            '(("." . "~/.config/emacs/undo")))

       (setq is-work nil)                         ; *--=~~ search for explanations ~~=--*
       ;; t means no truncation
       (setq history-length t)
       (setq history-delete-duplicates t)

       (savehist-mode 1)                           ; Saves your minibuffer histories
       (setq
           savehist-file "~/.config/emacs/savehist")    ; Set the savehist file
       (setq savehist-save-minibuffer-history 1)
       (setq savehist-additional-variables         ; Save other histories and other variables as well
           '(kill-ring
             search-ring
             regexp-search-ring))
    #+END_SRC
     #+end_src
* KEYMAPS
  :PROPERTIES:
  :header-args: :tangle ~/.config/emacs/KEYBIDING.el
  :header-args: :results none
  :END:
** Files
   #+begin_src emacs-lisp
     ;; some shortcuts -- files
     (global-set-key (kbd "C-c C") (lambda() (interactive)(find-file "~/.config/emacs/init.org")))
     (global-set-key (kbd "C-c b") (lambda() (interactive)(find-file "~/org/books.org")))
     (global-set-key (kbd "C-c I") (lambda() (interactive)(find-file "~/org/gtd/inbox.org")))
     (global-set-key (kbd "C-c L") (lambda() (interactive)(find-file "~/org/links.org")))
     (global-set-key (kbd "C-c E") (lambda() (interactive)(find-file "~/org/gtd/emails.org")))
     (global-set-key (kbd "<f12>") (lambda() (interactive)(find-file "~/org/files/org.pdf")))
     ;; Reload buffer with <F5>
     (global-set-key [f5] '(lambda () (interactive) (revert-buffer nil t nil)))
   #+end_src
** Apps
   #+begin_src emacs-lisp
         ;; packages
   #+end_src
** win-movements
   #+begin_src emacs-lisp
       (defun zk/split-go-right()
         (interactive)
         (split-window-horizontally)
         (windmove-right))
       (defun zk/split-go-down()
         (interactive)
         (split-window-vertically)
         (windmove-down))
        ;; try to go to the other window automaticly
        (global-set-key (kbd "C-x i") 'zk/split-go-right)
        (global-set-key (kbd "C-x m") 'zk/split-go-down)

        ;; Move between buffer
        (global-set-key (kbd "M-n") 'switch-to-next-buffer)
        (global-set-key (kbd "M-p") 'switch-to-prev-buffer)

        ;; Move between Windows
        (global-set-key (kbd "C-x k") 'windmove-up)
        (global-set-key (kbd "C-x j") 'windmove-down)
        (global-set-key (kbd "C-x l") 'windmove-right)
        (global-set-key (kbd "C-x h") 'windmove-left)

        ;; Resize windows
        (global-set-key (kbd "C-M-l") 'shrink-window-horizontally)
        (global-set-key (kbd "C-M-h") 'enlarge-window-horizontally)
        (global-set-key (kbd "C-M-j") 'shrink-window)
        (global-set-key (kbd "C-M-k") 'enlarge-window)

        (global-set-key (kbd "M-o") 'delete-other-windows)
        (global-set-key (kbd "C-x p") 'zk/org-agenda-process-inbox-item)
   #+end_src
* PACKAGES
  :PROPERTIES:
  :header-args: :tangle ~/.config/emacs/PACKAGES.el
  :header-args: :results none
  :END:
